'''

Манхэттенское расстояние

Прогуливаясь по Манхэттену, вы не можете попасть из точки А в точку Б по кратчайшему пути. Если только вы не умеете проходить сквозь стены, вам обязательно придется идти вдоль его параллельно-перпендикулярных улиц.

На плоскости манхэттенское расстояние между двумя точками (p1; p2)(p_{1}; \, p_{2})(p1​;p2​) и (q1; q2)(q_{1}; \, q_{2})(q1​;q2​) определяется так ∣p1−q1∣+∣p2−q2∣|p_{1}-q_{1}|+|p_{2}-q_{2}|∣p1​−q1​∣+∣p2​−q2​∣.

Напишите программу определяющую манхэттенское расстояние между двумя точками, координаты которых заданы.

Формат входных данных
На вход программе подается четыре целых числа, каждое на отдельной строке – p1, p2, q1, q2p_{1}, \, p_{2}, \, q_{1}, \, q_{2}p1​,p2​,q1​,q2​.

Формат выходных данных
Программа должна вывести одно число – манхэттенское расстояние.

Sample Input:

10
15
21
13

Sample Output:

13

'''


points = [0, 0, 0, 0]
for i in range(4):
    points[i] = int(input().strip())
    
dist = abs(points[0] - points[2]) + abs(points[1] - points[3])
print(dist)